EmbeddedSystemClass/Truck_Project1/PIC24_support/esos1/Truck_App.h
typedef enum
{
	NORMAL,
	PASSWORD,
	NUMENTRY,
}KEY_MODE;

KEY_MODE key_mode;

#endif
//******************************************************************************************//
//*************************************** menu_task ****************************************//
//******************************************************************************************//
ESOS_USER_TASK(menu_task)
{
	static UCHAR data1;
	static UINT data4;
    static ESOS_TASK_HANDLE menu_handle;
    static ESOS_TASK_HANDLE rt_handle;
    static int i,j;

	static ESOS_TASK_HANDLE comm1_handle;
	
    ESOS_TASK_BEGIN();

	menu_handle = esos_GetTaskHandle(display_menu);
	rt_handle = esos_GetTaskHandle(display_rtlabels);

	comm1_handle = esos_GetTaskHandle(send_comm1);

	while (TRUE)
	{
		ESOS_TASK_WAIT_FOR_MAIL();

		while(ESOS_TASK_IVE_GOT_MAIL())
		{
			data1 = __esos_CB_ReadUINT8(__pstSelf->pst_Mailbox->pst_CBuffer);
//	 		ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM();
//			ESOS_TASK_WAIT_ON_SEND_UINT8(data1);
//			ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM();

			switch(data1)
			{
				case 	KP_1:
					__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,ENABLE_STARTER);
					engine_on = 1;

					data4 = SET_DISPLAY_UPDATE_RATE;
					data4 <<= 8;
					data4 &= 0xFFFF;
					data4 |= 0xFF;
					__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data4);
/*
					data4 = LCD_PWM;
					data4 <<= 8;
					data4 &= 0xFF00;
					data4 |= PWM_60DC_PARAM;
					__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data4);
*/
				break;

				case 	KP_2:
					__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,ON_ACC);
					data4 = SET_DISPLAY_UPDATE_RATE;
					data4 <<= 8;
					data4 &= 0xFFFF;
					data4 |= 0x7F;
					__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data4);
/*
					data4 = LCD_PWM;
					data4 <<= 8;
					data4 &= 0xFF00;
					data4 |= PWM_80DC_PARAM;
					data3 |= PWM_ON_PARAM;
					data4 |= PWM_12DC_PARAM;
					__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data4);
*/
				break;

				case	KP_3:
					__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,OFF_ACC);
					data4 = SET_DISPLAY_UPDATE_RATE;
					data4 <<= 8;
					data4 &= 0xFFFF;
					data4 |= 0x3F;
					__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data4);
/*
					data4 = SPECIAL_TONE_ON;
					data4 <<= 8;
					data4 &= 0xFF00;
					__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data4);
*/
				break;

				case	KP_4:
					__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,ON_FUEL_PUMP);
					data4 = SET_DISPLAY_UPDATE_RATE;
					data4 <<= 8;
					data4 &= 0xFFFF;
					data4 |= 0x1F;
					__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data4);
				break;

				case	KP_5:
					__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,OFF_FUEL_PUMP);
				break;

				case	KP_6:
					__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,START_SEQ);
					engine_on = 1;
				break;

				case	KP_7:
					__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,SHUTDOWN);
					engine_on = 0;
				break;

				case	KP_8:
					avr_buffer[0] = LCD_CLRSCR;
					avr_buffer[1] = 0;
					AVR_CALL();
					curr_num_entry_row = 7;
					curr_num_entry_col = 2;
					avr_buffer[0] = GOTO_CMD;
					avr_buffer[1] = (UCHAR)curr_num_entry_row;
					avr_buffer[2] = (UCHAR)curr_num_entry_col;
					AVR_CALL();
					key_mode = NUMENTRY;
				break;

				case	KP_9:
					key_mode = NORMAL;
//					engine_shuttingdown = 1;
				break;

				case	KP_A:		// move up in menu
					if(menu_ptr < 1)
						menu_ptr = NUM_MENU_LABELS;
					menu_ptr--;	

					avr_buffer[0] = SET_MODE_CMD;
					avr_buffer[1] = TEXT_ON | CURSOR_BLINK_ON;
					avr_buffer[2] = menu_str[menu_ptr].row;
					avr_buffer[3] = menu_str[menu_ptr].col-2;
					avr_buffer[4] = (LINE_8_CURSOR);
					AVR_CALL();

				break;

				case	KP_B:		// move down in menu
/*
					avr_buffer[0] = SEND_INT_RT_VALUES;
					avr_buffer[1] = 0;
					avr_buffer[2] = 0;
					avr_buffer[3] = 1;
					avr_buffer[4] = 2;
					AVR_CALL();
*/

					if(++menu_ptr > NUM_MENU_LABELS - 1)
						menu_ptr = 0;

					avr_buffer[0] = SET_MODE_CMD;
					avr_buffer[1] = TEXT_ON | CURSOR_BLINK_ON;
					avr_buffer[2] = menu_str[menu_ptr].row;
					avr_buffer[3] = menu_str[menu_ptr].col-2;
					avr_buffer[4] = (LINE_8_CURSOR);
					AVR_CALL();

				break;

				case	KP_C:
					silent_key = 1;
/*
					avr_buffer[0] = SEND_INT_RT_VALUES;
					avr_buffer[1] = 0;
					avr_buffer[2] = 0;
					avr_buffer[3] = 2;
					avr_buffer[4] = 3;
					AVR_CALL();
*/
//					__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,
//						(menu_ptr+1)*2+menu_str[menu_ptr].onoff);
				break;

				case	KP_D:		// exec menu choice
					silent_key = 0;
					avr_buffer[0] = GOTO_CMD;
					avr_buffer[1] = menu_str[menu_ptr].row;
					avr_buffer[2] = menu_str[menu_ptr].col-2;
					AVR_CALL();

					if(menu_str[menu_ptr].onoff == 1)
						menu_str[menu_ptr].onoff = 0;
					else menu_str[menu_ptr].onoff = 1;
					avr_buffer[0] = CHAR_CMD;
					avr_buffer[1] = (menu_str[menu_ptr].onoff?'X':' ');
					AVR_CALL();

				break;

				case	KP_POUND:
					data4 = LCD_PWM;
					data4 <<= 8;
					data4 &= 0xFF00;
					data4 |= PWM_OFF_PARAM;
					__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data4);
					key_enter_time = 6500;	// something > 6400 so it won't come back on
											// unless key is pressed
					
				break;

				case	KP_AST:
					data4 = LCD_PWM;
					data4 <<= 8;
					data4 &= 0xFF00;
					data4 |= PWM_ON_PARAM;
					__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data4);
					key_enter_time = 0;

					avr_buffer[0] = LCD_CLRSCR;
					avr_buffer[1] = 0;
					AVR_CALL();
				break;

				case	KP_0:
					avr_buffer[0] = LCD_CLRSCR;
					avr_buffer[1] = 0;
					AVR_CALL();

					__esos_CB_WriteUINT8(menu_handle->pst_Mailbox->pst_CBuffer,data1);
					__esos_CB_WriteUINT8(rt_handle->pst_Mailbox->pst_CBuffer,data1);

				break;

				default:
				break;
			}
/*
			avr_buffer[0] = GOTO_CMD;
			avr_buffer[1] = 0;
			avr_buffer[2] = 0;
			AVR_CALL();

