EmbeddedSystemClass/Truck_Project1/PIC24_support/esos1/Truck_App.h
			avr_buffer[0] = CHAR_CMD;
			if(data1 >= KP_1 && data1 <= KP_9)
				avr_buffer[1] = data1 + 0x30-KP_1;
			else if(data1 >= KP_A && data1 <= KP_D)
				avr_buffer[1] = data1 + 0xE8-KP_A;
			else avr_buffer[1] = data1 + KP_1;	
			AVR_CALL();
*/
		}
	}
    ESOS_TASK_END();
}

//******************************************************************************************//
//************************************* password_task **************************************//
//******************************************************************************************//
ESOS_TASK_HANDLE password_task_handle;

ESOS_USER_TASK(password_task)
{
	static UCHAR data1, temp;
	static ESOS_TASK_HANDLE comm1_handle;
    static ESOS_TASK_HANDLE menu_handle;
    static ESOS_TASK_HANDLE rt_handle;

    ESOS_TASK_BEGIN();

    password_task_handle = ESOS_TASK_GET_TASK_HANDLE();
	comm1_handle = esos_GetTaskHandle(send_comm1);
	menu_handle = esos_GetTaskHandle(display_menu);
	rt_handle = esos_GetTaskHandle(display_rtlabels);
    
	ESOS_TASK_WAIT_TICKS(100);

#if 0
	avr_buffer[0] = LCD_CLRSCR;
	avr_buffer[1] = 0;
	AVR_CALL();

	avr_buffer[0] = GOTO_CMD;
	avr_buffer[1] = 7;
	avr_buffer[2] = (UCHAR)strlen(correct_password);
	AVR_CALL();
/*
	avr_buffer[0] = CHAR_CMD;
	avr_buffer[1] = 7;
	avr_buffer[2] = 0x3C;  // '<'
	AVR_CALL();
*/
	avr_buffer[0] = EEPROM_STR;
	avr_buffer[1] = 6;	// row 6
	avr_buffer[2] = 0;	// col 0
	avr_buffer[3] = VARIOUS_MSG_OFFSET;	//  ("enter password")
	avr_buffer[4] = 10;
	AVR_CALL();

	avr_buffer[0] = SET_MODE_CMD;
	avr_buffer[1] = TEXT_ON | CURSOR_BLINK_ON;
	avr_buffer[2] = 7;
	avr_buffer[3] = 0;
	avr_buffer[4] = (LINE_2_CURSOR);
	AVR_CALL();
#endif
	temp = 0;
	while (TRUE)
	{
		ESOS_TASK_WAIT_FOR_MAIL();

		while(ESOS_TASK_IVE_GOT_MAIL())
		{
			data1 = __esos_CB_ReadUINT8(__pstSelf->pst_Mailbox->pst_CBuffer);
			switch(data1)
			{
				case	KP_0:
				case 	KP_1:
				case	KP_2:
				case	KP_3:
				case	KP_4:
				case	KP_5:
				case	KP_6:
				case	KP_7:
				case	KP_8:
				case	KP_9:
					data1 = data1 - KP_1 + 0x31;
					password[password_ptr] = data1;
					avr_buffer[0] = CHAR_CMD;
					avr_buffer[1] = '*';
					AVR_CALL();

					avr_buffer[0] = SET_MODE_CMD;
					avr_buffer[1] = TEXT_ON | CURSOR_BLINK_ON;
					avr_buffer[2] = 7;
					avr_buffer[3] = password_ptr+1;
					avr_buffer[4] = (LINE_1_CURSOR);
					AVR_CALL();

				break;

				case	KP_A:
/*
					i = 0;
					while(password[i] != 0 && correct_password[i] != 0 &&
													 password[i] == correct_password[i])
					{
						i++;
					}
					if(i > PASSWORD_SIZE)
						temp == 2;
					else if(password[i] == correct_password[i])
						temp = 3;
*/
					break;

				// backspace over current password
				case	KP_B:
					password_ptr--;
					avr_buffer[0] = SET_MODE_CMD;
					avr_buffer[1] = TEXT_ON | CURSOR_BLINK_ON;
					avr_buffer[2] = 7;
					avr_buffer[3] = password_ptr;
					avr_buffer[4] = (LINE_1_CURSOR);
					AVR_CALL();
					break;

				case	KP_C:
				case	KP_D:
				case	KP_POUND:
				case	KP_AST:
				break;
				
				default:
				temp = 2;
				break;
			}

			// if password incorrect

			if(password[password_ptr] != correct_password[password_ptr])
			{

				// if incorrect password, first display "bad password" message
				avr_buffer[0] = LCD_CLRSCR;
				avr_buffer[1] = 0;
				AVR_CALL();

/*
				avr_buffer[0] = GOTO_CMD;
				avr_buffer[0] = 7;
				avr_buffer[0] = strlen(correct_password);
				AVR_CALL();

				avr_buffer[0] = CHAR_CMD;
				avr_buffer[0] = 7;
				avr_buffer[0] = '<';
				AVR_CALL();
*/
				avr_buffer[0] = EEPROM_STR;
				avr_buffer[1] = 5;
				avr_buffer[2] = 0;
				avr_buffer[3] = VARIOUS_MSG_OFFSET + 1;	// "bad password"
				avr_buffer[4] = 1;
				AVR_CALL();

				avr_buffer[0] = EEPROM_STR;
				avr_buffer[1] = 6;	// row 7
				avr_buffer[2] = 0;	// col 0
				avr_buffer[3] =  VARIOUS_MSG_OFFSET;	// ("enter password")
				avr_buffer[4] = 1;
				AVR_CALL();

				avr_buffer[0] = SET_MODE_CMD;
				avr_buffer[1] = TEXT_ON | CURSOR_BLINK_ON;
				avr_buffer[2] = 7;
				avr_buffer[3] = 0;
				avr_buffer[4] = (LINE_1_CURSOR);
				AVR_CALL();
				memset(password,0,PASSWORD_SIZE);
				password_ptr = -1;
				password_retries++;
			}else if(password_ptr == strlen(correct_password) - 1)
			{
				memset(password,0,PASSWORD_SIZE);
				password_ptr = -1;
				avr_buffer[0] = LCD_CLRSCR;
				avr_buffer[1] = 0;
				AVR_CALL();

//				__esos_CB_WriteUINT8(menu_handle->pst_Mailbox->pst_CBuffer,data1);

				__esos_CB_WriteUINT8(rt_handle->pst_Mailbox->pst_CBuffer,data1);
				key_mode = NORMAL;
				engine_shuttingdown = 0;
			}
			
//			}else if (password_ptr > strlen(correct_password) || )

			// for debugging - just start over
/*
			if(password_retries > 3)
			{
				password_valid = 1;
				avr_buffer[0] = LCD_CLRSCR;
				avr_buffer[1] = 0;
				AVR_CALL();

				avr_buffer[0] = EEPROM_STR;
				avr_buffer[1] = 6;	// row 6
				avr_buffer[2] = 0;	// col 0
				avr_buffer[3] = VARIOUS_MSG_OFFSET;	//  ("enter password")
				avr_buffer[4] = 10;
				AVR_CALL();

				avr_buffer[0] = SET_MODE_CMD;
				avr_buffer[1] = TEXT_ON | CURSOR_BLINK_ON;
				avr_buffer[2] = 7;
				avr_buffer[3] = 0;
				avr_buffer[4] = (LINE_1_CURSOR);
				AVR_CALL();
			}
*/
			password_ptr++;
			if(password_ptr > PASSWORD_SIZE)
				password_ptr = 0;

		}		// end of mail
	}	// end of 'while(TRUE)'
    ESOS_TASK_END();
}

//******************************************************************************************//
//************************************* numentry_task **************************************//
//******************************************************************************************//
ESOS_USER_TASK(numentry_task)
{
	static UCHAR data1;
	static int i;
	
    ESOS_TASK_BEGIN();
	memset(num_entry_num,0,SIZE_NUM);
	num_entry_ptr = 0;
	
	while (TRUE)
	{
		ESOS_TASK_WAIT_FOR_MAIL();

		while(ESOS_TASK_IVE_GOT_MAIL())
		{
			data1 = __esos_CB_ReadUINT8(__pstSelf->pst_Mailbox->pst_CBuffer);

/*
	KP_1 = 0xE0, // '1'		- E0
	KP_2, // '2'		- E1
	KP_3, // '3'		- E2
	KP_4, // '4'		- E3
	KP_5, // '5'		- E4
	KP_6, // '6'		- E5
	KP_7, // '7'		- E6
	KP_8, // '8'		- E7
	KP_9, // '9'		- E8
	KP_A, // 'A'		- E9
	KP_B, // 'B'		- EA
	KP_C, // 'C'		- EB
	KP_D, // 'D'		- EC
	KP_POUND,	// '#'	- ED
	KP_AST, // '*'		- EE
	KP_0 	// '0'		- EF
*/

			switch(data1)
			{
				case 	KP_1:
				case	KP_2:
				case	KP_3:
				case	KP_4:
				case	KP_5:
				case	KP_6:
				case	KP_7:
				case	KP_8:
				case	KP_9:
				case	KP_0:
					if(data1 == KP_0)
						data1 = data1 - KP_0;
					else	
						data1 = data1 - KP_1 + 1;
					num_entry_num[num_entry_ptr++] = data1;
					avr_buffer[0] = CHAR_CMD;
					avr_buffer[1] = data1 + 0x30;
					AVR_CALL();
					curr_num_entry_col++;

					avr_buffer[0] = SET_MODE_CMD;
					avr_buffer[1] = TEXT_ON | CURSOR_BLINK_ON;
					avr_buffer[2] = curr_num_entry_row;
					avr_buffer[3] = curr_num_entry_col;
					avr_buffer[4] = (LINE_1_CURSOR);
					AVR_CALL();
				break;

				// 'backspace'
				case	KP_B:
					avr_buffer[0] = GOTO_CMD;
					avr_buffer[1] = curr_num_entry_row;
					avr_buffer[2] = --curr_num_entry_col;
					AVR_CALL();
					avr_buffer[0] = CHAR_CMD;
					avr_buffer[1] = 0x20;
					AVR_CALL();
					avr_buffer[0] = SET_MODE_CMD;
					avr_buffer[1] = TEXT_ON | CURSOR_BLINK_ON;
					avr_buffer[2] = curr_num_entry_row;
					avr_buffer[3] = curr_num_entry_col;
					avr_buffer[4] = (LINE_1_CURSOR);
					AVR_CALL();
					num_entry_ptr--;
				break;
				// clear entry and start over
				case	KP_A:
				case	KP_C:
					curr_num_entry_col -= num_entry_ptr;
					avr_buffer[0] = GOTO_CMD;
					avr_buffer[1] = curr_num_entry_row;
					avr_buffer[2] = curr_num_entry_col;
					AVR_CALL();
					for(i = 0;i < num_entry_ptr;i++)
					{
						avr_buffer[0] = CHAR_CMD;
						avr_buffer[1] = 0x20;
						AVR_CALL();
					}
					avr_buffer[0] = GOTO_CMD;
					avr_buffer[1] = curr_num_entry_row;
					avr_buffer[2] = curr_num_entry_col;
					AVR_CALL();
					avr_buffer[0] = SET_MODE_CMD;
					avr_buffer[1] = TEXT_ON | CURSOR_BLINK_ON;
					avr_buffer[2] = curr_num_entry_row;
					avr_buffer[3] = curr_num_entry_col;
					avr_buffer[4] = (LINE_1_CURSOR);
					AVR_CALL();

