EmbeddedSystemClass/Truck_Project1/PIC24_support/esos1/Truck_App.h
/*
		avr_buffer[0] = EEPROM_STR;
		avr_buffer[1] = 1;	// row 1
		avr_buffer[2] = 0;	// col 0
		avr_buffer[3] = VARIOUS_MSG_OFFSET + 8;	//  engine run time msg
		avr_buffer[4] = 10;
		AVR_CALL();
*/
		avr_buffer[0] = SEND_INT_RT_VALUES;
		avr_buffer[1] = 15;
		avr_buffer[2] = 35;
		avr_buffer[3] = (UCHAR)(engine_run_time >> 8);
		avr_buffer[4] = (UCHAR)engine_run_time;
		AVR_CALL();

		if(engine_shutdown == 29)
		{
			data3 = SPECIAL_TONE_ON;
			data3 <<= 8;
			data3 &= 0xFF00;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
			data3 = LCD_PWM;
			data3 <<= 8;
			data3 &= 0xFF00;
			data3 |= PWM_ON_PARAM;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
			key_enter_time = 0;
			key_mode = PASSWORD;
			password_valid = 0;
 			memset(password,0,PASSWORD_SIZE);
			password_ptr = 0;
			avr_buffer[0] = GOTO_CMD;
			avr_buffer[1] = 0;
			avr_buffer[2] = 7;
			AVR_CALL();
			avr_buffer[0] = PASSWORD_MODE;
//			avr_buffer[1] = (UCHAR)strlen(correct_password);
			avr_buffer[1] = 0;
			AVR_CALL();

			avr_buffer[0] = EEPROM_STR;
			avr_buffer[1] = 0;	// row 0
			avr_buffer[2] = 0;	// col 0
			avr_buffer[3] = VARIOUS_MSG_OFFSET + 6;	//  re-enter password
			avr_buffer[4] = 10;
			AVR_CALL();

			avr_buffer[0] = EEPROM_STR;
			avr_buffer[1] = 0;	// row 0
			avr_buffer[2] = 20;	// col 0
			avr_buffer[3] = VARIOUS_MSG_OFFSET + 7;	//  in x seconds
			avr_buffer[4] = 10;
			AVR_CALL();
		}
		if(engine_shutdown == 28)
		{
			data3 = DTMF_TONE_OFF;
			data3 <<= 8;
			data3 &= 0xFF00;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
		}
		if(engine_shutdown > 1 && engine_shutdown < 30)
		{
//			avr_buffer[0] = SEND_INT_RT_VALUES;
			avr_buffer[0] = SEND_BYTE_RT_VALUES;
			avr_buffer[1] = 0;
			avr_buffer[2] = 23;
			avr_buffer[3] = (UCHAR)engine_shutdown;
//			avr_buffer[4] = (UCHAR)(engine_shutdown);
			AVR_CALL();
		}
		if(engine_shutdown == 5)
		{
			data3 = SPECIAL_TONE_ON;
			data3 <<= 8;
			data3 &= 0xFF00;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
		}
		if(engine_shutdown == 4)
		{
			data3 = DTMF_TONE_OFF;
			data3 <<= 8;
			data3 &= 0xFF00;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
		}
		if(engine_shutdown == 3)
		{
			data3 = SPECIAL_TONE_ON;
			data3 <<= 8;
			data3 &= 0xFF00;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
		}
		if(engine_shutdown == 2)
		{
			data3 = DTMF_TONE_OFF;
			data3 <<= 8;
			data3 &= 0xFF00;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
		}
		if(engine_shutdown == 1)
		{
			data3 = SPECIAL_TONE_ON;
			data3 <<= 8;
			data3 &= 0xFF00;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
		}

		if(engine_shutdown == 0)
		{
			data3 = DTMF_TONE_OFF;
			data3 <<= 8;
			data3 &= 0xFF00;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
			__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,SHUTDOWN);
			engine_shuttingdown = 0;
			engine_shutdown = 30;
			engine_on = 0;
			avr_buffer[0] = LCD_CLRSCR;
			avr_buffer[1] = 0;
			AVR_CALL();
			avr_buffer[0] = EEPROM_STR;
			avr_buffer[1] = 0;	// row 0
			avr_buffer[2] = 0;	// col 0
			avr_buffer[3] = VARIOUS_MSG_OFFSET + 9;
			avr_buffer[4] = 10;
			AVR_CALL();
		}
		if(engine_shuttingdown > 0)
			engine_shutdown--;
		else
		{
			engine_shutdown = 30;
/*
			avr_buffer[0] = GOTO_CMD;
			avr_buffer[1] = 0;
			avr_buffer[1] = 23;
			AVR_CALL();
			avr_buffer[0] = CHAR_CMD;
			avr_buffer[1] = 0x20;
			AVR_CALL();
			avr_buffer[0] = CHAR_CMD;
			avr_buffer[1] = 0x20;
			AVR_CALL();
*/
		}
		if(key_enter_time == 200)
		{
			data3 = LCD_PWM;
			data3 <<= 8;
			data3 &= 0xFF00;
			data3 |= PWM_80DC_PARAM;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
			dim_screen++;
		}
		if(key_enter_time == 400)
		{
			data3 = LCD_PWM;
			data3 <<= 8;
			data3 &= 0xFF00;
			data3 |= PWM_75DC_PARAM;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
			dim_screen++;
		}
		if(key_enter_time == 800)
		{
			data3 = LCD_PWM;
			data3 <<= 8;
			data3 &= 0xFF00;
			data3 |= PWM_50DC_PARAM;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
			dim_screen++;
		}
		if(key_enter_time == 1600)
		{
			data3 = LCD_PWM;
			data3 <<= 8;
			data3 &= 0xFF00;
			data3 |= PWM_25DC_PARAM;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
			dim_screen++;
		}
		if(key_enter_time == 3200)
		{
			data3 = LCD_PWM;
			data3 <<= 8;
			data3 &= 0xFF00;
			data3 |= PWM_12DC_PARAM;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
			dim_screen++;
		}
		if(key_enter_time == 6400)
		{
			data3 = LCD_PWM;
			data3 <<= 8;
			data3 &= 0xFF00;
			data3 |= PWM_OFF_PARAM;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
			dim_screen++;
		}
		key_enter_time++;
	}
    ESOS_TASK_END();
}
//******************************************************************************************//
//************************************** poll_keypad ***************************************//
//******************************************************************************************//
ESOS_USER_TASK(poll_keypad)
{

    static ESOS_TASK_HANDLE menu_task_handle;
    static ESOS_TASK_HANDLE password_handle;
    static ESOS_TASK_HANDLE numentry_handle;
	static UINT data3;

    ESOS_TASK_BEGIN();

	menu_task_handle = esos_GetTaskHandle(menu_task);
	password_handle = esos_GetTaskHandle(password_task);
	numentry_handle = esos_GetTaskHandle(numentry_task);

	configKeypad();

	while (TRUE)
	{
		ESOS_TASK_WAIT_SEMAPHORE(key_sem,1);
		if(u8_newKey)
		{
			switch(key_mode)
			{
				case NORMAL:
					__esos_CB_WriteUINT8(menu_task_handle->pst_Mailbox->pst_CBuffer,u8_newKey);
					break;
				case PASSWORD:
					__esos_CB_WriteUINT8(password_handle->pst_Mailbox->pst_CBuffer,u8_newKey);
					break;
				case NUMENTRY:
					__esos_CB_WriteUINT8(numentry_handle->pst_Mailbox->pst_CBuffer,u8_newKey);
					break;
				default:
					break;
			}
			u8_newKey = 0;	// very important to reset this to 0
			// if key_enter_time has dimmed screen then
			// turn it back on
	
